<!DOCTYPE html>
<html lang="ru">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Разбор 1 задания ЕГЭ по информатике</title>
    <link rel="stylesheet" href="styles.css">
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.4.0/css/all.min.css">
</head>
<body>
    <div class="container">
        <header>
            <h1><i class="fas fa-code"></i> Разбор 1 задания ЕГЭ по информатике</h1>
            <p class="subtitle">Параллельное и последовательное выполнение процессов</p>
        </header>

        <main>
            <div class="content-wrapper">
                <section class="task-section">
                    <h2><i class="fas fa-file-alt"></i> Условие задачи</h2>
                    <div class="task-text">
                        <p>В файле содержится информация о совокупности N вычислительных процессов, которые могут выполняться параллельно или последовательно. Будем говорить, что процесс B зависит от процесса A, если для выполнения процесса B необходимы результаты выполнения процесса A. В этом случае процессы могут выполняться только последовательно.</p>
                        <p>Информация о процессах представлена в файле в виде таблицы. В первом столбце таблицы указан идентификатор процесса (ID), во втором столбце таблицы — время его выполнения в миллисекундах, в третьем столбце перечислены с разделителем «;» ID процессов, от которых зависит данный процесс. Если процесс является независимым, то в таблице указано значение 0.</p>
                        
                        <div class="example">
                            <h3>Типовой пример организации данных в файле:</h3>
                            <table>
                                <thead>
                                    <tr>
                                        <th>ID процесса B</th>
                                        <th>Время выполнения процесса B (мс)</th>
                                        <th>ID процесса(ов) A</th>
                                    </tr>
                                </thead>
                                <tbody>
                                    <tr><td>1</td><td>4</td><td>0</td></tr>
                                    <tr><td>2</td><td>3</td><td>0</td></tr>
                                    <tr><td>3</td><td>1</td><td>1; 2</td></tr>
                                    <tr><td>4</td><td>7</td><td>3</td></tr>
                                </tbody>
                            </table>
                        </div>
                        
                        <p>Определите минимальное время, через которое завершится выполнение всей совокупности процессов, при условии, что все независимые друг от друга процессы могут выполняться параллельно.</p>
                    </div>
                    
                    <div class="file-download">
                        <h3><i class="fas fa-download"></i> Файл с данными для задания</h3>
                        <p>Скачайте файл с данными для выполнения задания:</p>
                        <a href="data.txt" class="download-btn" download>
                            <i class="fas fa-file-download"></i> Скачать data.txt
                        </a>
                    </div>
                </section>

                <section class="solution-section">
                    <h2><i class="fas fa-calculator"></i> Решение</h2>
                    
                    <div class="answer-form">
                        <h3>Введите ваш ответ</h3>
                        <p>На основе данных из файла определите минимальное время выполнения всех процессов и введите ответ в поле ниже:</p>
                        
                        <div class="input-group">
                            <input type="number" id="userAnswer" placeholder="Введите время в мс" min="0" step="1">
                            <button id="checkAnswer" class="check-btn">Проверить ответ</button>
                        </div>
                        
                        <div id="resultMessage" class="result-message"></div>
                    </div>
                    
                    <div class="explanation">
                        <h3><i class="fas fa-lightbulb"></i> Подробное объяснение решения</h3>
                        <p>Используя данные из файла, составим таблицу, на какой мс может закончится каждый из процессов:</p>
                        <ul>
                            <li>Процессы с ID «1», «2», «9» и «10» независимые, поэтому их выполнение закончится на 4, 3, 7 и 8 мс соответственно.</li>
                            <li>Процесс с ID «3» может выполняться только после завершения процессов с ID «1» и «2», поэтому он может завершиться на 5 мс.</li>
                            <li>Процессы с ID «4» и «5» зависят от процесса с ID «3», значит, они завершатся через 5 + 7  =  12 мс и 5 + 6  =  11 мс соответственно.</li>
                            <li>Процесс с ID «6» зависит от процесса с ID «5», значит, он завершится через 11 + 3  =  14 мс.</li>
                            <li>Процесс с ID «7» зависит от процессов с ID «4» и «6», следовательно, поскольку процесс с ID «6» завершится только на 14 мс, процесс с ID «7» выполнится на 14 + 1  =  15 мс.</li>
                            <li>Процесс с ID «8» зависит от процесса с ID «7», значит, он выполнится на 15 + 2  =  17 мс.</li>
                            <li>Процесс с ID «11» зависит от процесса с ID «9», поэтому он выполнится на 7 + 6  =  13 мс.</li>
                            <li>Процесс с ID «12» зависит от процесса с ID «10», поэтому он выполнится на 8 + 6  =  14 мс.</li>
                        </ul>
                        <p>Таким образом, вся совокупность процессов завершится на <strong>17 мс</strong>.</p>
                        
                        <div class="code-solution">
                            <h3><i class="fas fa-laptop-code"></i> Решение на Python</h3>
                            <div class="code-tabs">
                                <div class="tab active" data-tab="solution1">Решение 1</div>
                                <div class="tab" data-tab="solution2">Решение 2</div>
                            </div>
                            
                            <div class="code-content active" id="solution1">
                                <pre><code>import sys
d = {'0': 0}
for elem in sys.stdin:
    num, dur, *subs = elem.replace(';', ' ').split()
    d[num] = max([d[i] for i in subs]) + int(dur)
print(max(d.values()))</code></pre>
                                <p class="code-note">Запустив программу вводим данные из таблицы построчно, цифры в строках разделяем пробелом. Закончив ввод всех строк таблицы необходимо нажать CTRL + D.</p>
                            </div>
                            
                            <div class="code-content" id="solution2">
                                <pre><code>f = open("22.txt").read().split("\n")
m = {}
for i in f:
    s = i.split()
    if s[2] == '0':
        m[s[0]] = int(s[1])
    else:
        w = s[2].split(";")
        sp = []
        for j in w:
            j = j.replace(" ", "")
            sp.append(int(m[j]))
        m[s[0]] = int(s[1]) + max(sp)
print(max(m.values()))</code></pre>
                                <p class="code-note">Решение Никитиной Елизаветы на языке Python.</p>
                            </div>
                        </div>
                    </div>
                </section>
            </div>
        </main>

        <footer>
            <p>Пожалуйста, поставьте 5 :)</p>
            <p class="footer-note">Сделано Смирновой Никой</p>
        </footer>
    </div>

    <script src="script.js"></script>
</body>
</html>
