<!DOCTYPE html>
<html lang="ru">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Номер 22 - Параллельные процессы</title>
    <link rel="stylesheet" href="styles.css">
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.4.0/css/all.min.css">
</head>
<body>
        <main>
            <section class="task-section">
                <div class="task-header">
                    <h2><i class="fas fa-file-alt"></i> Условие задачи</h2>
                </div>
                
                <div class="task-content">
                    <p>В файле содержится информация о совокупности N вычислительных процессов, которые могут выполняться параллельно или последовательно. Будем говорить, что процесс B зависит от процесса A, если для выполнения процесса B необходимы результаты выполнения процесса A. В этом случае процессы могут выполняться только последовательно.</p>
                    
                    <p>Информация о процессах представлена в файле в виде таблицы. В первом столбце таблицы указан идентификатор процесса (ID), во втором столбце таблицы — время его выполнения в миллисекундах, в третьем столбце перечислены с разделителем «;» ID процессов, от которых зависит данный процесс. Если процесс является независимым, то в таблице указано значение 0.</p>
                    
                    <div class="example-box">
                        <h3><i class="fas fa-table"></i> Пример данных из файла:</h3>
                        <div class="table-wrapper">
                            <table>
                                <thead>
                                    <tr>
                                        <th>ID процесса</th>
                                        <th>Время выполнения (мс)</th>
                                        <th>ID процесса(ов)</th>
                                    </tr>
                                </thead>
                                <tbody>
                                    <tr><td>1</td><td>4</td><td>0</td></tr>
                                    <tr><td>2</td><td>3</td><td>0</td></tr>
                                    <tr><td>3</td><td>1</td><td>1; 2</td></tr>
                                    <tr><td>4</td><td>7</td><td>3</td></tr>
                                </tbody>
                            </table>
                        </div>
                    </div>
                    
                    <div class="task-question">
                        <p><strong>Определите минимальное время, через которое завершится выполнение всей совокупности процессов, при условии, что все независимые друг от друга процессы могут выполняться параллельно.</strong></p>
                    </div>
                </div>
            </section>

            <section class="file-section">
                <h2><i class="fas fa-download"></i> Файл с данными</h2>
                <div class="download-card">
                    <div class="file-info">
                        <div class="file-icon">
                            <i class="fas fa-file-excel"></i>
                        </div>
                        <div class="file-details">
                            <h3>data.ods</h3>
                            <p>Файл содержит данные о процессах для выполнения задания</p>
                        </div>
                    </div>
                    <a href="data.ods" class="download-btn" download>
                        <i class="fas fa-download"></i> Скачать файл
                    </a>
                </div>
                <p class="file-note">Скачайте файл, откройте его в табличном редакторе (LibreOffice Calc, Excel) и используйте данные для решения задачи.</p>
            </section>

            <section class="answer-section">
                <h2><i class="fas fa-check-circle"></i> Проверка ответа</h2>
                <div class="answer-card">
                    <p>Введите полученный ответ в поле ниже:</p>
                    
                    <div class="input-group">
                        <input type="number" id="userAnswer" placeholder="Введите время в миллисекундах" min="0" step="1">
                        <button id="checkAnswer" class="check-btn">
                            <i class="fas fa-check"></i> Проверить
                        </button>
                    </div>
                    
                    <div id="resultMessage" class="result-message"></div>
                </div>
            </section>

            <section id="solutionSection" class="solution-section" style="display: none;">
                <h2><i class="fas fa-lightbulb"></i> Решение задачи</h2>
                <div class="solution-content">
                    <div class="solution-steps">
                        <h3>Пошаговое решение:</h3>
                        <ol>
                            <li>Процессы с ID «1», «2», «9» и «10» независимые, поэтому их выполнение закончится на 4, 3, 7 и 8 мс соответственно.</li>
                            <li>Процесс с ID «3» может выполняться только после завершения процессов с ID «1» и «2», поэтому он может завершиться на 5 мс (max(4, 3) + 1 = 5).</li>
                            <li>Процессы с ID «4» и «5» зависят от процесса с ID «3», значит, они завершатся через 5 + 7 = 12 мс и 5 + 6 = 11 мс соответственно.</li>
                            <li>Процесс с ID «6» зависит от процесса с ID «5», значит, он завершится через 11 + 3 = 14 мс.</li>
                            <li>Процесс с ID «7» зависит от процессов с ID «4» и «6», следовательно, поскольку процесс с ID «6» завершится только на 14 мс, процесс с ID «7» выполнится на 14 + 1 = 15 мс.</li>
                            <li>Процесс с ID «8» зависит от процесса с ID «7», значит, он выполнится на 15 + 2 = 17 мс.</li>
                            <li>Процесс с ID «11» зависит от процесса с ID «9», поэтому он выполнится на 7 + 6 = 13 мс.</li>
                            <li>Процесс с ID «12» зависит от процесса с ID «10», поэтому он выполнится на 8 + 6 = 14 мс.</li>
                        </ol>
                        
                        <div class="final-answer">
                            <p>Таким образом, вся совокупность процессов завершится на <strong>17 мс</strong>.</p>
                        </div>
                    </div>
                    
                    <div class="code-solution">
                        <h3><i class="fas fa-code"></i> Решение на Python</h3>
                        <div class="code-block">
                            <pre><code>f = open("22.txt").read().split("\n")
m = {}
for i in f:
    s = i.split()
    if s[2] == '0':
        m[s[0]] = int(s[1])
    else:
        w = s[2].split(";")
        sp = []
        for j in w:
            j = j.replace(" ", "")
            sp.append(int(m[j]))
        m[s[0]] = int(s[1]) + max(sp)
print(max(m.values()))</code></pre>
                            <p class="code-note">Решение Никитиной Елизаветы на языке Python.</p>
                        </div>
                    </div>
                </div>
            </section>
        </main>

        <footer>
            <p>Проект Смирновы Ники</p>
            <p class="footer-note">Поставьте 5!</p>
        </footer>
    </div>

    <script src="script.js"></script>
</body>
</html>
